app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "author", "source_material", "motto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "House of Bob"], ["author", "Bob"], ["source_material", "Musical"], ["motto", ""], ["created_at", 2017-04-13 17:48:24 UTC], ["updated_at", 2017-04-13 17:48:24 UTC]]
---
  def create
    @house = House.new(house_params)

    if @house.save